docs/nguyen/posts/notused/delta_debugging.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="description" content="delta debugging stuff">
<link rel="alternate"
      type="application/rss+xml"
      href="./rss.xml"
      title="RSS feed for ./">
<title>Delta Debugging Complexity</title>
<meta name="author" content="ThanhVu Nguyen">
<meta name="referrer" content="no-referrer">
<link rel="stylesheet" type="text/css" href="https://dynaroars.github.io/files/org.css" />
<link href= "../files/org-orig.css" rel="stylesheet" type="text/css" /> 
<link rel="icon" href="../files/favicon.ico">
</head>
<body>
<div id="preamble" class="status"><div class="header">
  <a href="../index.html">ThanhVu Nguyen</a>,  
  <a href="index.html">Archive</a>
</div>
</div>
<div id="content">
<div class="post-date">31 Oct 2020</div><h1 class="post-title"><a href="./notused/delta_debugging.html">Delta Debugging Complexity</a></h1>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#best-case-complexity">1. Best-case Complexity</a></li>
<li><a href="#worst-case-complexity">2. Worst-case Complexity</a></li>
</ul>
</div>
</nav>
<p>
Many students get confused when asked about the complexity of the Delta Debugging (DD) algorithm discussed in my Software Testing class. Hopefully this note, which focuses on illustrating the complexity of DD using examples, can help.
</p>

<div id="outline-container-best-case-complexity" class="outline-2">
<h2 id="best-case-complexity"><span class="section-number-2">1.</span> Best-case Complexity</h2>
<div class="outline-text-2" id="text-best-case-complexity">
<p>
DD has a \(O(\lg N)\) (where <code>N</code> is the input size) <i>best case</i> complexity when its binary search-like
approach is effective, i.e., can reduce the input by half each time.
</p>

<p>
<b>Example</b>: Consider the oracle or test that returns <b>F</b> on either (i) inputs containing the string <code>5</code> or (ii) the input <code>1,2,3,4,5</code>, which for simplicity we will just write as <code>12345</code> below.
</p>

<table>


<colgroup>
<col  class="org-right">

<col  class="org-right">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">test</th>
<th scope="col" class="org-right">input</th>
<th scope="col" class="org-left">result</th>
<th scope="col" class="org-left">comment</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">12345</td>
<td class="org-left"><b>F</b></td>
<td class="org-left">starting DD with original input 12345, which is a fail (<b>F</b>)</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>n=2</code> 12/345</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">345</td>
<td class="org-left"><b>F</b></td>
<td class="org-left">we can remove 12 from 12345, restart DD on input 345</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>n=2</code> 34/5</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-right">5</td>
<td class="org-left"><b>F</b></td>
<td class="org-left">we can remove 34 from 345, since 5 can nolonger be splitted, DD stops and return 5 as the minimal failure input</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-worst-case-complexity" class="outline-2">
<h2 id="worst-case-complexity"><span class="section-number-2">2.</span> Worst-case Complexity</h2>
<div class="outline-text-2" id="text-worst-case-complexity">
<p>
DD has a <b>quadratic</b> <i>worst case</i> complexity, i.e., \(O(N^2)\).
That is, for some oracle (and sequence of splits), we can make DD perform \(O(N^2)\) tests.
The idea is that for an input of size <code>N</code> we would have to run \(O(N)\) tests to
reduce to a smaller input of size <code>N1</code> that is <code>N-1</code>. Then from the new
input of size <code>N1</code>, we would have to run <code>O(N1)</code> tests to reduce to a
smaller input of size <code>N2</code> that is <code>N1-1</code>. This keeps going until we
reach an input of size 1. In total, we perform
<code>N + N-1 + N-2 + .... + 1</code> = <code>1/2*(N+1)*N</code> tests, causing the quadratic
\(O(N^2)\) complexity.
</p>

<p>
<b>Example</b>: We use an example to illustrate this worst-case complexity.
In fact, we will construct the oracle causing this complexity directly
from this process. Consider the input <code>1,2,3,4,5</code>, which for simplicity
we will just write as <code>12345</code> below.
</p>

<table>


<colgroup>
<col  class="org-right">

<col  class="org-right">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">test</th>
<th scope="col" class="org-right">input</th>
<th scope="col" class="org-left">result</th>
<th scope="col" class="org-left">comment</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">12345</td>
<td class="org-left"><b>F</b></td>
<td class="org-left">starting DD with original input 12345, which is a fail (<b>F</b>)</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>n=2</code> 12/345</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">345</td>
<td class="org-left">P</td>
<td class="org-left">cannot remove 12</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-right">12</td>
<td class="org-left">P</td>
<td class="org-left">cannot remove 345</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>n=4</code> 1/2/3/45</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-right">2345</td>
<td class="org-left">P</td>
<td class="org-left">cannot remove 1</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-right">1345</td>
<td class="org-left">P</td>
<td class="org-left">cannot remove 2</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-right">1245</td>
<td class="org-left">P</td>
<td class="org-left">cannot remove 3</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-right">123</td>
<td class="org-left">P</td>
<td class="org-left">cannot remove 45</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>n=5</code> 1/2/3/4/5</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-right">2345</td>
<td class="org-left">P</td>
<td class="org-left">cannot remove 1 (same as test 4)</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-right">1345</td>
<td class="org-left">P</td>
<td class="org-left">cannot remove 2 (same as test 5)</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-right">1245</td>
<td class="org-left">P</td>
<td class="org-left">cannot remove 3 (same as test 6)</td>
</tr>

<tr>
<td class="org-right">11</td>
<td class="org-right">1235</td>
<td class="org-left">P</td>
<td class="org-left">cannot remove 4</td>
</tr>

<tr>
<td class="org-right">12</td>
<td class="org-right">1234</td>
<td class="org-left"><b>F</b></td>
<td class="org-left">we can remove 5 from 12345, restart DD with input <code>1234</code></td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>n=2</code> 12 / 34</td>
</tr>

<tr>
<td class="org-right">13</td>
<td class="org-right">34</td>
<td class="org-left">P</td>
<td class="org-left">cannot remove 12</td>
</tr>

<tr>
<td class="org-right">14</td>
<td class="org-right">12</td>
<td class="org-left">P</td>
<td class="org-left">cannot remove 34 (same as test 3)</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>n=4</code> 1234</td>
</tr>

<tr>
<td class="org-right">15</td>
<td class="org-right">234</td>
<td class="org-left">P</td>
<td class="org-left">cannot remove 1</td>
</tr>

<tr>
<td class="org-right">16</td>
<td class="org-right">134</td>
<td class="org-left">P</td>
<td class="org-left">cannot remove 2</td>
</tr>

<tr>
<td class="org-right">17</td>
<td class="org-right">124</td>
<td class="org-left"><b>F</b></td>
<td class="org-left">we can remove 3 from 1234, restart DD with input <code>124</code></td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>n=2</code> 1/24</td>
</tr>

<tr>
<td class="org-right">18</td>
<td class="org-right">24</td>
<td class="org-left">P</td>
<td class="org-left">cannot remove 1</td>
</tr>

<tr>
<td class="org-right">19</td>
<td class="org-right">1</td>
<td class="org-left">P</td>
<td class="org-left">cannot remove 24</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>n=3</code> 1/2/4</td>
</tr>

<tr>
<td class="org-right">20</td>
<td class="org-right">24</td>
<td class="org-left">P</td>
<td class="org-left">cannot remove 1 (same as test 18)</td>
</tr>

<tr>
<td class="org-right">21</td>
<td class="org-right">14</td>
<td class="org-left"><b>F</b></td>
<td class="org-left">we can remove 2 from 124, restart DD with input <code>14</code></td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>n=2</code> 1/4</td>
</tr>

<tr>
<td class="org-right">22</td>
<td class="org-right">4</td>
<td class="org-left">P</td>
<td class="org-left">cannot remove 1</td>
</tr>

<tr>
<td class="org-right">23</td>
<td class="org-right">1</td>
<td class="org-left">P</td>
<td class="org-left">cannot remove 4. (same as test 19). DD stops and returns 14 as the minimal failure input</td>
</tr>
</tbody>
</table>

<p>
Thus in this example where we have an input of size <code>N=5</code>, we perform DD on <code>23</code> tests, i.e., \(O(N^2)\).
Note that we redo many tests (e.g., test 8 is the same as test 4), but
in general we do <code>O(N^2)</code> unique tests.
</p>

<p>
<b>Constructing the oracle</b>: From the above worst case execution, we can
reconstruct the oracle or test that results in this execution.
This is done by simply making the oracle return <b>F</b> on input having values
<code>12345</code>, <code>1234</code>, <code>124</code>, or <code>14</code> and returns <b>P</b> on every other inputs:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #51afef;">def</span> <span style="color: #c678dd;">test</span>(s):
    <span style="color: #51afef;">return</span> s <span style="color: #51afef;">in</span> {<span style="color: #98be65;">'12345'</span>,<span style="color: #98be65;">'1234'</span>,<span style="color: #98be65;">'124'</span>,<span style="color: #98be65;">'14'</span>}
</pre>
</div>

<p>
<span class="underline">Note</span>: pay attention to test 17 where we have 124 as F instead of P.
The reason is because if we have 124 as P, then we would now test 123,
which must be a P because 123 was a P in test 7 (i.e., we cannot have
123 as a P in one test and as an F in another). And if that's the case
then we stop DD at 17 tests and return 1234. But if we make 124 as F,
then we can continue DD as shown above (i.e., we make DD work a bit
harder to achieve higher complexity). This is similar for test 19, we
make input 14 F so that we can continue DD with 14 instead of stoping
(because 12 is P).
</p>
</div>
</div>
<div class="taglist"><a href="./tags.html">Tags</a>: <a href="./tag-blog.html">blog</a> <a href="./tag-teaching.html">teaching</a> <a href="./tag-delta-debugging.html">delta-debugging</a> </div></div>
<div id="postamble" class="status"><!-- <div id="archive"><a href="archive.html">Other posts</a></div>  -->
</div>
</body>
</html>
